# Reviewing Window Functions

### Introduction

With the previous question, we were re-introduced to window functions.  In this lesson, we'll take another look at the fundamentals of window functions.

### Window Functions Review

In [20]:
import pandas as pd
url = "./transactions.csv"
df = pd.read_csv(url, low_memory=False)
df[:2]

   id        date  store_nbr  transactions
0   0  2013-01-01         25           770
1   1  2013-01-02          1          2111

In [21]:
import sqlite3

conn = sqlite3.connect('crm.db')

In [24]:
df.to_sql('stores', conn, if_exists = 'replace', index = False)

83488

In [28]:
query = '''SELECT id, store_nbr, transactions
from stores limit 5'''
pd.read_sql(query, conn)

   id  store_nbr  transactions
0   0         25           770
1   1          1          2111
2   2          2          2358
3   3          3          3487
4   4          4          1922

With window functions we use the `with over` syntax to calculate an aggregate for each previously existing row.  For example, we can use `dense_rank` to get a ranking of transactions across all stores and dates.

In [31]:
query = '''SELECT id, store_nbr, transactions, 
dense_rank() over (order by transactions) as rank
from stores limit 5'''
pd.read_sql(query, conn)

      id  store_nbr  transactions  rank
0  65479         43             5     1
1  52392          2             6     2
2  52428          1            10     3
3  57950         53            33     4
4  58003         53            54     5